login/app/views/secrets/index.html.erb

SELECT "likes".* FROM "likes"  WHERE "likes"."secret_id" = ?  [["secret_id", 1]]
SELECT COUNT(*) FROM "likes"  WHERE "likes"."secret_id" = ?  [["secret_id", 3]]
SELECT  1 AS one FROM "secrets" INNER JOIN "likes" ON "secrets"."id" = "likes"."secret_id" WHERE "likes"."user_id" = ? AND "secrets"."id" = 1 LIMIT 1  [["user_id", 3]]
SELECT "secrets".* FROM "secrets" INNER JOIN "likes" ON "secrets"."id" = "likes"."secret_id" WHERE "likes"."user_id" = ?  [["user_id", 3]]
---

		<p>  Likes:<%= secret.likes.count(:all) %>!

			<% unless @user.secrets.include?(secret) %>

SELECT  "likes".* FROM "likes"  WHERE "likes"."secret_id" = ? AND "likes"."user_id" = 3  ORDER BY "likes"."id" ASC LIMIT 1  [["secret_id", 3]]
---
			<% else %>
				<% like = secret.likes.where(:user_id => @user.id).first %>