login/app/views/user/show.html.erb

SELECT "likes".* FROM "likes"  WHERE "likes"."secret_id" = ?  [["secret_id", 3]]
SELECT COUNT(*) FROM "likes"  WHERE "likes"."secret_id" = ?  [["secret_id", 7]]
---
		<%= link_to 'Delete', secret, method: :delete, data: { confirm: 'Are you sure?' } %>
		<p>  Likes:<%= secret.likes.count(:all) %>!</p>

SELECT "secrets".* FROM "secrets" INNER JOIN "likes" ON "secrets"."id" = "likes"."secret_id" WHERE "likes"."user_id" = ?  [["user_id", 3]]
---
<h2>My Secrets</h2>
<% @user.secrets.each do |secret| %>

SELECT  "secrets".* FROM "secrets"  WHERE "secrets"."id" = ? LIMIT 1  [["id", 3]]
---
			<p> <%= like.secret.content %>
			<p>  Likes:<%= like.secret.likes.count(:all) %>!</p>