login/app/controllers/likes_controller.rb

INSERT INTO "likes" ("created_at", "secret_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2016-12-12 20:39:26.844706"], ["secret_id", 3], ["updated_at", "2016-12-12 20:39:26.844706"], ["user_id", 1]]
---
def create

	@like = Like.new(:user_id => session[:user_id], :secret_id => params[:format])

      if @like.save

DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 64]]
---
def destroy

    @like.destroy

SELECT  "likes".* FROM "likes"  WHERE "likes"."id" = ? LIMIT 1  [["id", 64]]
---
    def set_like
      @like = Like.find(params[:id])