login/app/controllers/secrets_controller.rb

SELECT "secrets".* FROM "secrets"
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
---
  def index
  	@secrets = Secret.all
  	@like = Like.new
  	@user = User.find(session[:user_id])

DELETE FROM "secrets" WHERE "secrets"."id" = ?  [["id", 5]]
---
  def destroy
    @secret.destroy

INSERT INTO "secrets" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "new secret"], ["created_at", "2016-12-12 17:54:54.646031"], ["updated_at", "2016-12-12 17:54:54.646031"], ["user_id", 4]]
---
  def create
  	@secret = Secret.new(secret_params)

      if @secret.save

SELECT  "secrets".* FROM "secrets"  WHERE "secrets"."id" = ? LIMIT 1  [["id", 5]]
---
    def set_secret
      @secret = Secret.find(params[:id])