login/app/controllers/user_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 4 LIMIT 1
SELECT  "secrets".* FROM "secrets"  WHERE "secrets"."user_id" = 4 LIMIT 1
---
  def show
    if params[:id] == session[:user_id].to_s
      @user = User.find_by(id: params[:id])
      @secret = Secret.new
      @secrets = Secret.where(user_id: params[:id])

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
  	user = User.new(user_params)

  	if user.save